waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_cmu.h
/**
  *******************************************************************************************************
  * @file    fm33fk5xx_fl_cmu.h
  * @author  FMSH Application Team
  * @brief   Head file of CMU FL Module
  *******************************************************************************************************
  * @attention
  *
  * Copyright (c) [2019] [Fudan Microelectronics]
  * THIS SOFTWARE is licensed under the Mulan PSL v1.
  * can use this software according to the terms and conditions of the Mulan PSL v1.
  * You may obtain a copy of Mulan PSL v1 at:
  * http://license.coscl.org.cn/MulanPSL
  * THIS SOFTWARE IS PROVIDED ON AN "AS IS" BASIS, WITHOUT WARRANTIES OF ANY KIND, EITHER EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO NON-INFRINGEMENT, MERCHANTABILITY OR FIT FOR A PARTICULAR
  * PURPOSE.
  * See the Mulan PSL v1 for more details.
  *
  *******************************************************************************************************
  */

/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33FK5XX_FL_CMU_H
#define __FM33FK5XX_FL_CMU_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33fk5xx_fl_def.h"
/** @addtogroup FM33FK5XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CMU_FL_ES_INIT CMU Exported Init structures
  * @{
  */

/**
  * @brief FL CMU Init Sturcture definition
  */
typedef enum
{
    FL_SYSTEM_CLOCK_RCHF_8M = 0,
    FL_SYSTEM_CLOCK_RCHF_16M,
    FL_SYSTEM_CLOCK_RCHF_24M,
    FL_SYSTEM_CLOCK_PLL_RCHF_32M,
    FL_SYSTEM_CLOCK_PLL_RCHF_48M,
    FL_SYSTEM_CLOCK_PLL_RCHF_64M,
    FL_SYSTEM_CLOCK_PLL_RCHF_80M,
    FL_SYSTEM_CLOCK_RCLP,
    FL_SYSTEM_CLOCK_XTHF,
    FL_SYSTEM_CLOCK_USB,
} FL_SystemClock;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup CMU_FL_Exported_Constants CMU Exported Constants
  * @{
  */

#define    CMU_SYSCLKCR_SLP_ENEXTI_Pos                                (25U)
#define    CMU_SYSCLKCR_SLP_ENEXTI_Msk                                (0x1U << CMU_SYSCLKCR_SLP_ENEXTI_Pos)
#define    CMU_SYSCLKCR_SLP_ENEXTI                                    CMU_SYSCLKCR_SLP_ENEXTI_Msk

#define    CMU_SYSCLKCR_APB2PRES_Pos                                  (19U)
#define    CMU_SYSCLKCR_APB2PRES_Msk                                  (0x7U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    CMU_SYSCLKCR_APB2PRES                                      CMU_SYSCLKCR_APB2PRES_Msk

#define    CMU_SYSCLKCR_APB1PRES_Pos                                  (16U)
#define    CMU_SYSCLKCR_APB1PRES_Msk                                  (0x7U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    CMU_SYSCLKCR_APB1PRES                                      CMU_SYSCLKCR_APB1PRES_Msk

#define    CMU_SYSCLKCR_USBCLOKSEL_Pos                                (14U)
#define    CMU_SYSCLKCR_USBCLOKSEL_Msk                                (0x3U << CMU_SYSCLKCR_USBCLOKSEL_Pos)
#define    CMU_SYSCLKCR_USBCLOKSEL                                    CMU_SYSCLKCR_USBCLOKSEL_Msk

#define    CMU_SYSCLKCR_AHBPRES_Pos                                   (8U)
#define    CMU_SYSCLKCR_AHBPRES_Msk                                   (0x7U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    CMU_SYSCLKCR_AHBPRES                                       CMU_SYSCLKCR_AHBPRES_Msk

#define    CMU_SYSCLKCR_STCLKSEL_Pos                                  (6U)
#define    CMU_SYSCLKCR_STCLKSEL_Msk                                  (0x3U << CMU_SYSCLKCR_STCLKSEL_Pos)
#define    CMU_SYSCLKCR_STCLKSEL                                      CMU_SYSCLKCR_STCLKSEL_Msk

#define    CMU_SYSCLKCR_BCKREFCKS_Pos                                 (5U)
#define    CMU_SYSCLKCR_BCKREFCKS_Msk                                 (0x1U << CMU_SYSCLKCR_BCKREFCKS_Pos)
#define    CMU_SYSCLKCR_BCKREFCKS                                     CMU_SYSCLKCR_BCKREFCKS_Msk

#define    CMU_SYSCLKCR_BCKPRES_Pos                                   (3U)
#define    CMU_SYSCLKCR_BCKPRES_Msk                                   (0x3U << CMU_SYSCLKCR_BCKPRES_Pos)
#define    CMU_SYSCLKCR_BCKPRES                                       CMU_SYSCLKCR_BCKPRES_Msk

#define    CMU_SYSCLKCR_SYSCLKSEL_Pos                                 (0U)
#define    CMU_SYSCLKCR_SYSCLKSEL_Msk                                 (0x7U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    CMU_SYSCLKCR_SYSCLKSEL                                     CMU_SYSCLKCR_SYSCLKSEL_Msk

#define    CMU_RCHFCR_FSEL_Pos                                    (16U)
#define    CMU_RCHFCR_FSEL_Msk                                    (0xfU << CMU_RCHFCR_FSEL_Pos)
#define    CMU_RCHFCR_FSEL                                        CMU_RCHFCR_FSEL_Msk

#define    CMU_RCHFCR_EN_Pos                                      (0U)
#define    CMU_RCHFCR_EN_Msk                                      (0x1U << CMU_RCHFCR_EN_Pos)
#define    CMU_RCHFCR_EN                                          CMU_RCHFCR_EN_Msk

#define    CMU_RCHFTR_TRIM_Pos                                    (0U)
#define    CMU_RCHFTR_TRIM_Msk                                    (0xffU << CMU_RCHFTR_TRIM_Pos)
#define    CMU_RCHFTR_TRIM                                        CMU_RCHFTR_TRIM_Msk

#define    CMU_PLLCR_DB_Pos                                       (16U)
#define    CMU_PLLCR_DB_Msk                                       (0x7fU << CMU_PLLCR_DB_Pos)
#define    CMU_PLLCR_DB                                           CMU_PLLCR_DB_Msk

#define    CMU_PLLCR_LOCKED_Pos                                   (7U)
#define    CMU_PLLCR_LOCKED_Msk                                   (0x1U << CMU_PLLCR_LOCKED_Pos)
#define    CMU_PLLCR_LOCKED                                       CMU_PLLCR_LOCKED_Msk

#define    CMU_PLLCR_REFPRSC_Pos                                  (4U)
#define    CMU_PLLCR_REFPRSC_Msk                                  (0x7U << CMU_PLLCR_REFPRSC_Pos)
#define    CMU_PLLCR_REFPRSC                                      CMU_PLLCR_REFPRSC_Msk

#define    CMU_PLLCR_INSEL_Pos                                    (1U)
#define    CMU_PLLCR_INSEL_Msk                                    (0x3U << CMU_PLLCR_INSEL_Pos)
#define    CMU_PLLCR_INSEL                                        CMU_PLLCR_INSEL_Msk

#define    CMU_PLLCR_EN_Pos                                       (0U)
#define    CMU_PLLCR_EN_Msk                                       (0x1U << CMU_PLLCR_EN_Pos)
#define    CMU_PLLCR_EN                                           CMU_PLLCR_EN_Msk

