waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_cmu.h
#define    CMU_OPCCR1_UART1CKS_Pos                                (2U)
#define    CMU_OPCCR1_UART1CKS_Msk                                (0x3U << CMU_OPCCR1_UART1CKS_Pos)
#define    CMU_OPCCR1_UART1CKS                                    CMU_OPCCR1_UART1CKS_Msk

#define    CMU_OPCCR1_UART0CKS_Pos                                (0U)
#define    CMU_OPCCR1_UART0CKS_Msk                                (0x3U << CMU_OPCCR1_UART0CKS_Pos)
#define    CMU_OPCCR1_UART0CKS                                    CMU_OPCCR1_UART0CKS_Msk

#define    CMU_OPCCR2_EPWM3CKS_Pos                                (30U)
#define    CMU_OPCCR2_EPWM3CKS_Msk                                (0x3U << CMU_OPCCR2_EPWM3CKS_Pos)
#define    CMU_OPCCR2_EPWM3CKS                                    CMU_OPCCR2_EPWM3CKS_Msk

#define    CMU_OPCCR2_EPWM2CKS_Pos                                (28U)
#define    CMU_OPCCR2_EPWM2CKS_Msk                                (0x3U << CMU_OPCCR2_EPWM2CKS_Pos)
#define    CMU_OPCCR2_EPWM2CKS                                    CMU_OPCCR2_EPWM2CKS_Msk

#define    CMU_OPCCR1_EPWM1CKS_Pos                                (26U)
#define    CMU_OPCCR1_EPWM1CKS_Msk                                (0x3U << CMU_OPCCR1_EPWM1CKS_Pos)
#define    CMU_OPCCR1_EPWM1CKS                                    CMU_OPCCR1_EPWM1CKS_Msk

#define    CMU_OPCCR2_EPWM0CKS_Pos                                (24U)
#define    CMU_OPCCR2_EPWM0CKS_Msk                                (0x3U << CMU_OPCCR2_EPWM0CKS_Pos)
#define    CMU_OPCCR2_EPWM0CKS                                    CMU_OPCCR2_EPWM0CKS_Msk

#define    CMU_OPCCR2_FDCANCKS_Pos                                (18U)
#define    CMU_OPCCR2_FDCANCKS_Msk                                (0x3U << CMU_OPCCR2_FDCANCKS_Pos)
#define    CMU_OPCCR2_FDCANCKS                                    CMU_OPCCR2_FDCANCKS_Msk

#define    CMU_OPCCR2_FSCANCKS_Pos                                (16U)
#define    CMU_OPCCR2_FSCANCKS_Msk                                (0x3U << CMU_OPCCR2_FSCANCKS_Pos)
#define    CMU_OPCCR2_FSCANCKS                                    CMU_OPCCR2_FSCANCKS_Msk

#define    CMU_OPCCR2_RNGPRSC_Pos                                 (10U)
#define    CMU_OPCCR2_RNGPRSC_Msk                                 (0x7U << CMU_OPCCR2_RNGPRSC_Pos)
#define    CMU_OPCCR2_RNGPRSC                                     CMU_OPCCR2_RNGPRSC_Msk

#define    CMU_OPCCR2_ADCPRSC_Pos                                 (2U)
#define    CMU_OPCCR2_ADCPRSC_Msk                                 (0x7U << CMU_OPCCR2_ADCPRSC_Pos)
#define    CMU_OPCCR2_ADCPRSC                                     CMU_OPCCR2_ADCPRSC_Msk

#define    CMU_OPCCR2_ADCCKS_Pos                                  (0U)
#define    CMU_OPCCR2_ADCCKS_Msk                                  (0x3U << CMU_OPCCR2_ADCCKS_Pos)
#define    CMU_OPCCR2_ADCCKS                                      CMU_OPCCR2_ADCCKS_Msk


#define    CMU_CCCR_IE_Pos                                        (1U)
#define    CMU_CCCR_IE_Msk                                        (0x1U << CMU_CCCR_IE_Pos)
#define    CMU_CCCR_IE                                            CMU_CCCR_IE_Msk

#define    CMU_CCCR_EN_Pos                                        (0U)
#define    CMU_CCCR_EN_Msk                                        (0x1U << CMU_CCCR_EN_Pos)
#define    CMU_CCCR_EN                                            CMU_CCCR_EN_Msk

#define    CMU_CCFR_CALPSC_Pos                                    (10U)
#define    CMU_CCFR_CALPSC_Msk                                    (0x3U << CMU_CCFR_CALPSC_Pos)
#define    CMU_CCFR_CALPSC                                        CMU_CCFR_CALPSC_Msk

#define    CMU_CCFR_REFPSC_Pos                                    (8U)
#define    CMU_CCFR_REFPSC_Msk                                    (0x3U << CMU_CCFR_REFPSC_Pos)
#define    CMU_CCFR_REFPSC                                        CMU_CCFR_REFPSC_Msk

#define    CMU_CCFR_CALSEL_Pos                                    (1U)
#define    CMU_CCFR_CALSEL_Msk                                    (0x3U << CMU_CCFR_CALSEL_Pos)
#define    CMU_CCFR_CALSEL                                        CMU_CCFR_CALSEL_Msk

#define    CMU_CCFR_REFSEL_Pos                                    (0U)
#define    CMU_CCFR_REFSEL_Msk                                    (0x1U << CMU_CCFR_REFSEL_Pos)
#define    CMU_CCFR_REFSEL                                        CMU_CCFR_REFSEL_Msk

#define    CMU_CCNR_CNT_Pos                                       (0U)
#define    CMU_CCNR_CNT_Msk                                       (0xffffU << CMU_CCNR_CNT_Pos)
#define    CMU_CCNR_CNT                                           CMU_CCNR_CNT_Msk

#define    CMU_CCISR_IF_Pos                                       (0U)
#define    CMU_CCISR_IF_Msk                                       (0x1U << CMU_CCISR_IF_Pos)
#define    CMU_CCISR_IF                                           CMU_CCISR_IF_Msk

#define    FL_CMU_GROUP1_BUSCLK_LPTIM16                           (0x1U << 0U)
#define    FL_CMU_GROUP1_BUSCLK_USB                               (0x1U << 1U)
#define    FL_CMU_GROUP1_BUSCLK_PMU                               (0x1U << 3U)
#define    FL_CMU_GROUP1_BUSCLK_SCU                               (0x1U << 4U)
#define    FL_CMU_GROUP1_BUSCLK_IWDT                              (0x1U << 5U)
#define    FL_CMU_GROUP1_BUSCLK_ANAC                              (0x1U << 6U)
#define    FL_CMU_GROUP1_BUSCLK_PAD                               (0x1U << 7U)
#define    FL_CMU_GROUP1_BUSCLK_SVD                               (0x1U << 8U)
#define    FL_CMU_GROUP1_BUSCLK_COMP                              (0x1U << 9U)
#define    FL_CMU_GROUP2_BUSCLK_CRC                               (0x1U << 0U)
#define    FL_CMU_GROUP2_BUSCLK_RNG                               (0x1U << 1U)
#define    FL_CMU_GROUP2_BUSCLK_AES                               (0x1U << 2U)
#define    FL_CMU_GROUP2_BUSCLK_DMA                               (0x1U << 4U)
#define    FL_CMU_GROUP2_BUSCLK_FLASH                             (0x1U << 5U)
#define    FL_CMU_GROUP2_BUSCLK_RAMBIST                           (0x1U << 6U)
#define    FL_CMU_GROUP2_BUSCLK_WWDT                              (0x1U << 7U)
#define    FL_CMU_GROUP2_BUSCLK_ADC                               (0x1U << 8U)
#define    FL_CMU_GROUP2_BUSCLK_DAC                               (0x1U << 9U)
#define    FL_CMU_GROUP2_BUSCLK_OPA                               (0x1U << 10U)
#define    FL_CMU_GROUP2_BUSCLK_PGL                               (0x1U << 11U)
#define    FL_CMU_GROUP3_BUSCLK_SPI0                              (0x1U << 0U)
#define    FL_CMU_GROUP3_BUSCLK_SPI1                              (0x1U << 1U)
#define    FL_CMU_GROUP3_BUSCLK_SPI2                              (0x1U << 2U)
#define    FL_CMU_GROUP3_BUSCLK_SPI3                              (0x1U << 3U)
#define    FL_CMU_GROUP3_BUSCLK_SPI4                              (0x1U << 4U)
#define    FL_CMU_GROUP3_BUSCLK_EPSC                              (0x1U << 6U)
#define    FL_CMU_GROUP3_BUSCLK_UART0                             (0x1U << 8U)
#define    FL_CMU_GROUP3_BUSCLK_UART1                             (0x1U << 9U)
#define    FL_CMU_GROUP3_BUSCLK_UART2                             (0x1U << 10U)
#define    FL_CMU_GROUP3_BUSCLK_UART3                             (0x1U << 11U)
#define    FL_CMU_GROUP3_BUSCLK_UART4                             (0x1U << 12U)
#define    FL_CMU_GROUP3_BUSCLK_UART5                             (0x1U << 13U)
#define    FL_CMU_GROUP3_BUSCLK_UART6                             (0x1U << 14U)
#define    FL_CMU_GROUP3_BUSCLK_UART7                             (0x1U << 15U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART0                           (0x1U << 16U)
#define    FL_CMU_GROUP3_BUSCLK_LPUART1                           (0x1U << 17U)
#define    FL_CMU_GROUP3_BUSCLK_FSCAN                             (0x1U << 19U)
#define    FL_CMU_GROUP3_BUSCLK_FDCAN                             (0x1U << 20U)
#define    FL_CMU_GROUP3_BUSCLK_UCIR                              (0x1U << 23U)
#define    FL_CMU_GROUP3_BUSCLK_I2C0                              (0x1U << 24U)
#define    FL_CMU_GROUP3_BUSCLK_I2C1                              (0x1U << 25U)
#define    FL_CMU_GROUP3_BUSCLK_I2CSMB0                           (0x1U << 28U)
#define    FL_CMU_GROUP3_BUSCLK_I2CSMB1                           (0x1U << 29U)
#define    FL_CMU_GROUP3_BUSCLK_I2CSMB2                           (0x1U << 30U)
#define    FL_CMU_GROUP4_BUSCLK_GTIM0                             (0x1U << 1U)
#define    FL_CMU_GROUP4_BUSCLK_GTIM1                             (0x1U << 2U)
#define    FL_CMU_GROUP4_BUSCLK_GTIM2                             (0x1U << 3U)
#define    FL_CMU_GROUP4_BUSCLK_ATIM0                             (0x1U << 4U)
#define    FL_CMU_GROUP4_BUSCLK_ATIM1                             (0x1U << 5U)
#define    FL_CMU_GROUP4_BUSCLK_BSTIM16                           (0x1U << 8U)
#define    FL_CMU_GROUP4_BUSCLK_EPWM                             (0x1U << 16U)
#define    FL_CMU_OPCLK_EXTI                                      (0x1U << 31U)
#define    FL_CMU_OPCLK_FLASH                                     (0x1U << 30U)
#define    FL_CMU_OPCLK_LPUART1                                   (0x1U << 29U)
#define    FL_CMU_OPCLK_LPUART0                                   (0x1U << 28U)
#define    FL_CMU_OPCLK_RNG                                       (0x1U << 24U)
#define    FL_CMU_OPCLK_I2CSMB2                                   (0x1U << 22U)
#define    FL_CMU_OPCLK_I2CSMB1                                   (0x1U << 21U)
#define    FL_CMU_OPCLK_I2CSMB0                                   (0x1U << 20U)
#define    FL_CMU_OPCLK_ADC                                       (0x1U << 16U)
#define    FL_CMU_OPCLK_ATIM1                                     (0x1U << 15U)
#define    FL_CMU_OPCLK_ATIM0                                     (0x1U << 14U)
#define    FL_CMU_OPCLK_UART3                                     (0x1U << 7U)
#define    FL_CMU_OPCLK_UART2                                     (0x1U << 6U)
#define    FL_CMU_OPCLK_UART1                                     (0x1U << 5U)
#define    FL_CMU_OPCLK_UART0                                     (0x1U << 4U)
#define    FL_CMU_OPCLK_BSTIM16                                   (0x1U << 3U)
#define    FL_CMU_OPCLK_LPTIM16                                   (0x1U << 1U)
#define    FL_CMU_OPCLK_EPWM0                                     (0x1U << 0U)
#define    FL_CMU_OPCLK_EPWM1                                     (0x1U << 1U)
#define    FL_CMU_OPCLK_EPWM2                                     (0x1U << 2U)
#define    FL_CMU_OPCLK_EPWM3                                     (0x1U << 3U)
#define    FL_CMU_OPCLK_FSCAN                                     (0x1U << 8U)
#define    FL_CMU_OPCLK_FDCAN                                     (0x1U << 9U)

