waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_cmu.h
#define    FL_CMU_APB2CLK_PSC_DIV2                                (0x0U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV4                                (0x5U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV8                                (0x6U << CMU_SYSCLKCR_APB2PRES_Pos)
#define    FL_CMU_APB2CLK_PSC_DIV16                               (0x7U << CMU_SYSCLKCR_APB2PRES_Pos)

#define    FL_CMU_APB1CLK_PSC_DIV1                                (0x0U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV2                                (0x4U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV4                                (0x5U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV8                                (0x6U << CMU_SYSCLKCR_APB1PRES_Pos)
#define    FL_CMU_APB1CLK_PSC_DIV16                               (0x7U << CMU_SYSCLKCR_APB1PRES_Pos)

#define    FL_CMU_USB_CLK_OUT_48M                                 (0x0U << CMU_SYSCLKCR_USBCLOKSEL_Pos)
#define    FL_CMU_USB_CLK_OUT_96M                                 (0x1U << CMU_SYSCLKCR_USBCLOKSEL_Pos)
#define    FL_CMU_USB_CLK_OUT_120M                                (0x2U << CMU_SYSCLKCR_USBCLOKSEL_Pos)
#define    FL_CMU_USB_CLK_OUT_240M                                (0x3U << CMU_SYSCLKCR_USBCLOKSEL_Pos)

#define    FL_CMU_AHBCLK_PSC_DIV1                                 (0x0U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV2                                 (0x4U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV4                                 (0x5U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV8                                 (0x6U << CMU_SYSCLKCR_AHBPRES_Pos)
#define    FL_CMU_AHBCLK_PSC_DIV16                                (0x7U << CMU_SYSCLKCR_AHBPRES_Pos)

#define    FL_CMU_SYSTICK_CLK_SOURCE_AHB_DIV8                     (0x0U << CMU_SYSCLKCR_STCLKSEL_Pos)
#define    FL_CMU_SYSTICK_CLK_SOURCE_XTLF                         (0x1U << CMU_SYSCLKCR_STCLKSEL_Pos)
#define    FL_CMU_SYSTICK_CLK_SOURCE_RCLP                         (0x2U << CMU_SYSCLKCR_STCLKSEL_Pos)

#define    FL_CMU_USB_REF_CLK_XTLF                                (0x0U << CMU_SYSCLKCR_BCKREFCKS_Pos)
#define    FL_CMU_USB_REF_CLK_XTHF                                (0x1U << CMU_SYSCLKCR_BCKREFCKS_Pos)

#define    FL_CMU_USB_CLK_PSC_DIV1                                (0x0U << CMU_SYSCLKCR_BCKPRES_Pos)
#define    FL_CMU_USB_CLK_PSC_DIV2                                (0x1U << CMU_SYSCLKCR_BCKPRES_Pos)
#define    FL_CMU_USB_CLK_PSC_DIV4                                (0x2U << CMU_SYSCLKCR_BCKPRES_Pos)
#define    FL_CMU_USB_CLK_PSC_DIV8                                (0x3U << CMU_SYSCLKCR_BCKPRES_Pos)

#define    FL_CMU_SYSTEM_CLK_SOURCE_RCHF                          (0x0U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_XTHF                          (0x1U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_PLL                           (0x3U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_PLL_VC0                       (0x5U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_RCLP                          (0x6U << CMU_SYSCLKCR_SYSCLKSEL_Pos)
#define    FL_CMU_SYSTEM_CLK_SOURCE_USB_BCK_PSC                   (0x7U << CMU_SYSCLKCR_SYSCLKSEL_Pos)

#define    FL_CMU_RCHF_FREQUENCY_8MHZ                             (0x0U << CMU_RCHFCR_FSEL_Pos)
#define    FL_CMU_RCHF_FREQUENCY_16MHZ                            (0x1U << CMU_RCHFCR_FSEL_Pos)
#define    FL_CMU_RCHF_FREQUENCY_24MHZ                            (0x2U << CMU_RCHFCR_FSEL_Pos)
#define    FL_CMU_RCHF_FREQUENCY_32MHZ                            (0x3U << CMU_RCHFCR_FSEL_Pos)

#define    FL_CMU_PLL_PSC_DIV1                                    (0x0U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV2                                    (0x1U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV4                                    (0x2U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV8                                    (0x3U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV12                                   (0x4U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV16                                   (0x5U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV24                                   (0x6U << CMU_PLLCR_REFPRSC_Pos)
#define    FL_CMU_PLL_PSC_DIV32                                   (0x7U << CMU_PLLCR_REFPRSC_Pos)

#define    FL_CMU_PLL_CLK_SOURCE_RCHF                             (0x0U << CMU_PLLCR_INSEL_Pos)
#define    FL_CMU_PLL_CLK_SOURCE_XTHF                             (0x1U << CMU_PLLCR_INSEL_Pos)

#define    FL_CMU_XTHF_START_WAIT_CYCLE_128                       (0x0U << CMU_XTHFCR_WAIT_Pos)
#define    FL_CMU_XTHF_START_WAIT_CYCLE_256                       (0x1U << CMU_XTHFCR_WAIT_Pos)
#define    FL_CMU_XTHF_START_WAIT_CYCLE_512                       (0x2U << CMU_XTHFCR_WAIT_Pos)
#define    FL_CMU_XTHF_START_WAIT_CYCLE_1024                      (0x3U << CMU_XTHFCR_WAIT_Pos)
#define    FL_CMU_XTHF_START_WAIT_CYCLE_2048                      (0x4U << CMU_XTHFCR_WAIT_Pos)
#define    FL_CMU_XTHF_START_WAIT_CYCLE_4096                      (0x5U << CMU_XTHFCR_WAIT_Pos)
#define    FL_CMU_XTHF_START_WAIT_CYCLE_8192                      (0x6U << CMU_XTHFCR_WAIT_Pos)
#define    FL_CMU_XTHF_START_WAIT_CYCLE_16384                     (0x7U << CMU_XTHFCR_WAIT_Pos)

#define    FL_CMU_EXTI_CLK_SOURCE_RCLP                            (0x1U << CMU_OPCCR1_EXTICKS_Pos)
#define    FL_CMU_EXTI_CLK_SOURCE_HCLK                            (0x0U << CMU_OPCCR1_EXTICKS_Pos)

#define    FL_CMU_LINWKUP_CLK_SOURCE_RCLP                         (0x1U << CMU_OPCCR1_LINCKS_Pos)
#define    FL_CMU_LINWKUP_CLK_SOURCE_XTLF                         (0x0U << CMU_OPCCR1_LINCKS_Pos)

#define    FL_CMU_LPUART1_CLK_SOURCE_XTLF                         (0x0U << CMU_OPCCR1_LPUART1CKS_Pos)
#define    FL_CMU_LPUART1_CLK_SOURCE_RCHF_PSC                     (0x1U << CMU_OPCCR1_LPUART1CKS_Pos)

#define    FL_CMU_LPUART0_CLK_SOURCE_XTLF                         (0x0U << CMU_OPCCR1_LPUART0CKS_Pos)
#define    FL_CMU_LPUART0_CLK_SOURCE_RCHF_PSC                     (0x1U << CMU_OPCCR1_LPUART0CKS_Pos)

#define    FL_CMU_I2CSMB2_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_I2CSMB2_Pos)
#define    FL_CMU_I2CSMB2_CLK_SOURCE_RCHF                         (0x1U << CMU_OPCCR1_I2CSMB2_Pos)
#define    FL_CMU_I2CSMB2_CLK_SOURCE_SYSCLK                       (0x2U << CMU_OPCCR1_I2CSMB2_Pos)

#define    FL_CMU_I2CSMB1_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_I2CSMB1_Pos)
#define    FL_CMU_I2CSMB1_CLK_SOURCE_RCHF                         (0x1U << CMU_OPCCR1_I2CSMB1_Pos)
#define    FL_CMU_I2CSMB1_CLK_SOURCE_SYSCLK                       (0x2U << CMU_OPCCR1_I2CSMB1_Pos)

#define    FL_CMU_I2CSMB0_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_I2CSMB0_Pos)
#define    FL_CMU_I2CSMB0_CLK_SOURCE_RCHF                         (0x1U << CMU_OPCCR1_I2CSMB0_Pos)
#define    FL_CMU_I2CSMB0_CLK_SOURCE_SYSCLK                       (0x2U << CMU_OPCCR1_I2CSMB0_Pos)

#define    FL_CMU_BSTIM16_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_BT16CKS_Pos)
#define    FL_CMU_BSTIM16_CLK_SOURCE_XTLF                         (0x1U << CMU_OPCCR1_BT16CKS_Pos)
#define    FL_CMU_BSTIM16_CLK_SOURCE_RCLP                         (0x2U << CMU_OPCCR1_BT16CKS_Pos)

