waterinthefall/FDU-Microelectronics-Development-Project/Drivers/FM33FK5xx_FL_Driver/Inc/fm33fk5xx_fl_cmu.h
#define    FL_CMU_UART3_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_UART3CKS_Pos)
#define    FL_CMU_UART3_CLK_SOURCE_RCHF                           (0x1U << CMU_OPCCR1_UART3CKS_Pos)
#define    FL_CMU_UART3_CLK_SOURCE_SYSCLK                         (0x2U << CMU_OPCCR1_UART3CKS_Pos)
#define    FL_CMU_UART3_CLK_SOURCE_XTHF                           (0x3U << CMU_OPCCR1_UART3CKS_Pos)

#define    FL_CMU_LPTIM16_CLK_SOURCE_APBCLK                       (0x0U << CMU_OPCCR1_LPT16CKS_Pos)
#define    FL_CMU_LPTIM16_CLK_SOURCE_XTLF                         (0x1U << CMU_OPCCR1_LPT16CKS_Pos)
#define    FL_CMU_LPTIM16_CLK_SOURCE_RCLP                         (0x2U << CMU_OPCCR1_LPT16CKS_Pos)

#define    FL_CMU_UART2_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_UART2CKS_Pos)
#define    FL_CMU_UART2_CLK_SOURCE_RCHF                           (0x1U << CMU_OPCCR1_UART2CKS_Pos)
#define    FL_CMU_UART2_CLK_SOURCE_SYSCLK                         (0x2U << CMU_OPCCR1_UART2CKS_Pos)
#define    FL_CMU_UART2_CLK_SOURCE_XTHF                           (0x3U << CMU_OPCCR1_UART2CKS_Pos)

#define    FL_CMU_ATIM1_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_AT1CKS_Pos)
#define    FL_CMU_ATIM1_CLK_SOURCE_PLLx2                          (0x1U << CMU_OPCCR1_AT1CKS_Pos)

#define    FL_CMU_ATIM0_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_AT0CKS_Pos)
#define    FL_CMU_ATIM0_CLK_SOURCE_PLLx2                          (0x1U << CMU_OPCCR1_AT0CKS_Pos)

#define    FL_CMU_UART1_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_UART1CKS_Pos)
#define    FL_CMU_UART1_CLK_SOURCE_RCHF                           (0x1U << CMU_OPCCR1_UART1CKS_Pos)
#define    FL_CMU_UART1_CLK_SOURCE_SYSCLK                         (0x2U << CMU_OPCCR1_UART1CKS_Pos)
#define    FL_CMU_UART1_CLK_SOURCE_XTHF                           (0x3U << CMU_OPCCR1_UART1CKS_Pos)

#define    FL_CMU_UART0_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_UART0CKS_Pos)
#define    FL_CMU_UART0_CLK_SOURCE_RCHF                           (0x1U << CMU_OPCCR1_UART0CKS_Pos)
#define    FL_CMU_UART0_CLK_SOURCE_SYSCLK                         (0x2U << CMU_OPCCR1_UART0CKS_Pos)
#define    FL_CMU_UART0_CLK_SOURCE_XTHF                           (0x3U << CMU_OPCCR1_UART0CKS_Pos)

#define    FL_CMU_UARTx_CLK_SOURCE_NONE                           (0)

#define    FL_CMU_EPWM3_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR2_EPWM3CKS_Pos)
#define    FL_CMU_EPWM3_CLK_SOURCE_USB_BCK_PSC                    (0x1U << CMU_OPCCR2_EPWM3CKS_Pos)
#define    FL_CMU_EPWM3_CLK_SOURCE_PLLx2                          (0x2U << CMU_OPCCR2_EPWM3CKS_Pos)
#define    FL_CMU_EPWM3_CLK_SOURCE_PLLx1                          (0x3U << CMU_OPCCR2_EPWM3CKS_Pos)

#define    FL_CMU_EPWM2_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR2_EPWM2CKS_Pos)
#define    FL_CMU_EPWM2_CLK_SOURCE_USB_BCK_PSC                    (0x1U << CMU_OPCCR2_EPWM2CKS_Pos)
#define    FL_CMU_EPWM2_CLK_SOURCE_PLLx2                          (0x2U << CMU_OPCCR2_EPWM2CKS_Pos)
#define    FL_CMU_EPWM2_CLK_SOURCE_PLLx1                          (0x3U << CMU_OPCCR2_EPWM2CKS_Pos)

#define    FL_CMU_EPWM1_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR1_EPWM1CKS_Pos)
#define    FL_CMU_EPWM1_CLK_SOURCE_USB_BCK_PSC                    (0x1U << CMU_OPCCR1_EPWM1CKS_Pos)
#define    FL_CMU_EPWM1_CLK_SOURCE_PLLx2                          (0x2U << CMU_OPCCR1_EPWM1CKS_Pos)
#define    FL_CMU_EPWM1_CLK_SOURCE_PLLx1                          (0x3U << CMU_OPCCR1_EPWM1CKS_Pos)

#define    FL_CMU_EPWM_CLK_SOURCE_APBCLK                         (0x0U << CMU_OPCCR2_EPWM0CKS_Pos)
#define    FL_CMU_EPWM_CLK_SOURCE_USB_BCK_PSC                    (0x1U << CMU_OPCCR2_EPWM0CKS_Pos)
#define    FL_CMU_EPWM_CLK_SOURCE_PLLx2                          (0x2U << CMU_OPCCR2_EPWM0CKS_Pos)
#define    FL_CMU_EPWM_CLK_SOURCE_PLLx1                          (0x3U << CMU_OPCCR2_EPWM0CKS_Pos)

#define    FL_CMU_FDCAN_CLK_SOURCE_RCHF                           (0x0U << CMU_OPCCR2_FDCANCKS_Pos)
#define    FL_CMU_FDCAN_CLK_SOURCE_XTHF                           (0x1U << CMU_OPCCR2_FDCANCKS_Pos)
#define    FL_CMU_FDCAN_CLK_SOURCE_PLL                            (0x2U << CMU_OPCCR2_FDCANCKS_Pos)
#define    FL_CMU_FDCAN_CLK_SOURCE_APBCLK                         (0x3U << CMU_OPCCR2_FDCANCKS_Pos)

#define    FL_CMU_FSCAN_CLK_SOURCE_RCHF                           (0x0U << CMU_OPCCR2_FSCANCKS_Pos)
#define    FL_CMU_FSCAN_CLK_SOURCE_XTHF                           (0x1U << CMU_OPCCR2_FSCANCKS_Pos)
#define    FL_CMU_FSCAN_CLK_SOURCE_PLL                            (0x2U << CMU_OPCCR2_FSCANCKS_Pos)
#define    FL_CMU_FSCAN_CLK_SOURCE_APBCLK                         (0x3U << CMU_OPCCR2_FSCANCKS_Pos)

#define    FL_CMU_RNG_PSC_DIV1                                    (0x0U << CMU_OPCCR2_RNGPRSC_Pos)
#define    FL_CMU_RNG_PSC_DIV2                                    (0x1U << CMU_OPCCR2_RNGPRSC_Pos)
#define    FL_CMU_RNG_PSC_DIV4                                    (0x2U << CMU_OPCCR2_RNGPRSC_Pos)
#define    FL_CMU_RNG_PSC_DIV8                                    (0x3U << CMU_OPCCR2_RNGPRSC_Pos)
#define    FL_CMU_RNG_PSC_DIV16                                   (0x4U << CMU_OPCCR2_RNGPRSC_Pos)
#define    FL_CMU_RNG_PSC_DIV32                                   (0x5U << CMU_OPCCR2_RNGPRSC_Pos)

#define    FL_CMU_ADC_PSC_DIV1                                    (0x0U << CMU_OPCCR2_ADCPRSC_Pos)
#define    FL_CMU_ADC_PSC_DIV2                                    (0x1U << CMU_OPCCR2_ADCPRSC_Pos)
#define    FL_CMU_ADC_PSC_DIV4                                    (0x2U << CMU_OPCCR2_ADCPRSC_Pos)
#define    FL_CMU_ADC_PSC_DIV8                                    (0x3U << CMU_OPCCR2_ADCPRSC_Pos)
#define    FL_CMU_ADC_PSC_DIV16                                   (0x4U << CMU_OPCCR2_ADCPRSC_Pos)
#define    FL_CMU_ADC_PSC_DIV32                                   (0x5U << CMU_OPCCR2_ADCPRSC_Pos)

#define    FL_CMU_ADC_CLK_SOURCE_APBCLK                           (0x0U << CMU_OPCCR2_ADCCKS_Pos)
#define    FL_CMU_ADC_CLK_SOURCE_RCHF                             (0x1U << CMU_OPCCR2_ADCCKS_Pos)
#define    FL_CMU_ADC_CLK_SOURCE_XTHF                             (0x2U << CMU_OPCCR2_ADCCKS_Pos)
#define    FL_CMU_ADC_CLK_SOURCE_PLL                              (0x3U << CMU_OPCCR2_ADCCKS_Pos)

#define    FL_CMU_AHB_MASTER_PRIORITY_DMA                         (0x0U << CMU_AHBMCR_MPRIL_Pos)
#define    FL_CMU_AHB_MASTER_PRIORITY_CPU                         (0x1U << CMU_AHBMCR_MPRIL_Pos)

